import React from "react";
import Header from "../components/Header";
import Footer from "../components/Footer";

const Privacypolicy = () => {
  const textStyle = {
    fontSize: "1.3rem",
    margin: "20px 0",
  };

  const containerStyle = {
    minHeight: '100vh',
    display: 'flex',
    flexDirection: 'column',
};
  
const contentStyle = {
  flex: 1,
  padding: '20px',
  display: 'flex',
  flexDirection: 'column',
  marginBottom: 'auto', 
};


const scrollableContentStyle = {
  overflowY: 'auto',
  maxHeight: '80vh', 
};


  return (
    <div   style={containerStyle} >
      <Header />
      <div style={contentStyle}>
        <div style={scrollableContentStyle}>
        <p style={textStyle}>
          في ماي ستور نحن نستخدمها بكيفية استخدام المعلومات المتعلقة بك
          ومشاركتها، ونقدر لك ثقتك بأننا نقوم بذلك بحذر وحساسية. هذا الإشعار
          يشرح سياسة الخصوصية الخاصة بنا. من خلال خيار لـماي ستور، أنت توافق على
          تفضل المشروحة في إشعار الخصوصية هذا. ما هي المعلومات الشخصية عن
          العملاء الذين يقومون ماي ستور بجمعها؟ ماذا عن ملفات تعريف الارتباط ؟
          هل تشارك ماي ستور المعلومات التي تصل إليها؟ إلى أي حد من المعلومات
          الخاصة بي آمنة؟ ماذا عن إعلانات طرف ثالث و روابط لمواقع أخرى؟ ماهي
          المعلومات التي وصلت إليها؟ ما هي الخيارات المتاحة لي؟ هل فائدة للأطفال
          باستخدام ماي ستور؟ شروط الاستخدام، التنبيهات، والتغييرات. أمثلة على
          المعلومات التي يتم جمعها. ما هي المعلومات الشخصية عن العملاء الذين
          يقومون ماي ستور بجمعها؟ المعلومات التي نتعلمها عن المشاهير تساعدنا على
          تخصيص واستمرار تجربتك مع ماي ستور. هذه أنواع المعلومات التي نجمعها
          المعلومات المتوفرة بواسطتك: نحن لا نحتفظ بأي معلومات تشير إليها في
          موقعنا أو في أي مكان آخر. اضغط هنا للتأكيد على أمثلة من المعلومات التي
          تم جمعها. لك حرية اختيار عدم تزويدنا بمعلومات معينة، ولكن بعد ذلك قد
          لا تتوفر الحرية الكاملة من العديد من مميزاتنا. قمنا بتزويدنا
          بالمعلومات التي تزودنا بالأهداف مثل طلبك لطلباتك، تخصيص خيارات التسوق
          المستقبلية لك، تطوير متجرنا، والتواصل معك. المعلومات التلقائية: نحن
          نستلم ونحتفظ بمعلومات خاصة عندما نتفاعلت معنا. مثال: كالعديد من
          المواقع، نحن نستخدم "ملفات تعريف الارتباط" ونصل إلى معلومات معينة ما
          متى كان المتصفح يستخدم موقع ماي ستور أو الإعلانات أو المحتوى أو
          الاعتماد عن طريق أو استخدام ماي ستور في أي مواقع أخرى . اضغط هنا
          للتأكيد على أمثلة من المعلومات التي تم جمعها. أجهزة الجوال: عند تحميل
          أو استخدام التطبيقات المنشأة بواسطة ماي ستور أو شركائها، يمكن أن تحصل
          على معلومات عن الموقع ونوع جهاز الجوال المستخدم بالإضافة إلى معرّف
          لفريدك. يمكن استخدام هذه المعلومات لاستخدامها في استخدام خدمات على
          الموقع، كالإعلانات، ونتائج البحث، أو المحتوى المخصص أخيرًا. يمكنك
          إلغاء تفعيل خدمة الموقع. التواصل عبر البريد الإلكتروني: لمساعدتنا على
          رسائل البريد الإلكتروني لدينا عبر البريد الإلكتروني أكثر إثارة
          الزجاجة، وتحصل على تأكيد في حال فتحك للبريد الإلكتروني وصلك من ماي
          ستور إذا كان جهازك يدعم هذه الخاصة. نحن نتحدث أيضًا بمقارنة قائمة
          العملاء بالقوائم التي تحصل عليها من شركات أخرى، ولن نتجنب إرسال رسائل
          غير مهمة. معلومات من مصادر أخرى: قد تحصل على معلومات عنكبوتية من مصادر
          أخرى ونقوم بإضافتها إلى معلومات الحسابات الخاصة بنا. ماذا عن ملفات
          تعريف الارتباط ؟ ملفات تعريف الارتباط هي ملفات تعريف الارتباط هي
          معرفات الكبد الجديدة المباشرة لجهازك لتتمكن من أنظمتنا من التعرف على
          جهازك ولها مميزات مثل الشراء بنقرة واحدة، واقتراحاتنا لك، وإعلانات
          مخصصة لك في مواقع أخرى. خدمة " المساعدة" في معظم المتصفحات ستخبرك كيف
          تقوم بحماية متصفحك من قبول ملفات تعريف الارتباط جديد، وكيف تقوم بجعل
          المتصفح يقوم بتنبيهك عندما تتلقى ملفات تعريف الارتباط جديد، أو كيف
          تقوم بتعطيل جميع ملفات تعريف الارتباط مرة واحدة. بالإضافة إلى ذلك،
          تستطيع القيام بتعطيل أو حذف البيانات المتشابهة التي تستخدم بواسطة
          إضافات المتصفح، كملفات تعريف الارتباط المؤقتة، من خلال تعديل إعدادات
          الإضافات أو زيارة موقع المصنّع الخاص بالإضافة. لأن ملفات تعريف
          الارتباط تمكنك من الاستفادة من مزايا موقع ماي ستور المهمة، ننصحك
          بتركها تعمل. مثال، إذا رفضت أو حظرت ملفات تعريف الارتباط الخاص بنا، لن
          تستطيع إضافة منتجات إلى سلة المشتريات الخاصة بك، أو الاستمرار للدفع،
          أو استخدام أي منتجات أو خدمات ماي ستور التي تتطلب تسجيل الدخول. هل
          يشارك ماي ستور المعلومات التي تصل إليه؟ المعلومات عن عملائنا هي جزء
          مهم جداً من عملنا، ونحن لا نقوم ببيعها على الآخرين. نقوم بمشاركة
          معلومات العملاء فقط كما سيتم شرحها أدناه، وبالنسبة لشركاء ماي ستور
          يخضعون لاتفاقية الخصوصية أو يتبعون ممارسات بمستوى حماية الممارسات
          المذكورة في اتفاقية الخصوصية. مقدمي الخدمات من طرف ثالث: نقوم بتعيين
          شركات أخرى أو أفراد للقيام ببعض المهام بالنيابة عنا، الأمثلة تتضمن
          تلبية الطلبات، توصيل الشحنات، ارسال الرسائل البريدية والإلكترونية،
          إزالة المعلومات المتكررة من قائمة العملاء، تحليل البيانات، توفير
          مساعدة تسويقية، توفير نتائج بحث وروابط (تتضمن القوائم والروابط
          المدفوعة)، إجراء الدفع عن طريق البطاقات الائتمانية، وتقديم خدمة
          العملاء. يستطيعون الوصول إلى المعلومات الشخصية التي يحتاجون إليها
          لإنجاز عملهم لكن لا يسمح لهم استخدامها لأية أغراض أخرى. العروض
          الترويجية: نقوم في بعض الأحيان بإرسال عروض ترويجية لمجموعة محددة من
          ماي ستور نيابة عن مشاريع أخرى. عندما نفعل ذلك نحن لا نقوم بمشاركة
          عنوانك واسمك مع الآخرين. انتقال المشروع: بينما نستمر في تطوير أعمالنا
          ، قد نبيع أو نشتري متاجر أو فروعًا أو وحدات أعمال. في مثل هذه
          المعاملات ، عادة ما تكون معلومات العميل واحدة من أصول العمل المحولة
          ولكنها تظل خاضعة للوعود التي تم تقديمها في أي إشعار خصوصية موجود
          مسبقًا (ما لم يوافق العميل على خلاف ذلك). أيضاً في حالة – الغير
          متوقعة- الاستحواذ على ماي ستور، أو كل أصوله بشكل أساسي ، ستكون معلومات
          العميل بالطبع أحد الأصول المنقولة. حماية ماي ستور والآخرين: نقوم بنشر
          حساب أو معلومات شخصية أخرى عندما نؤمن بأن النشر ملائم ويخضع للقانون؛
          أو فرض أو تطبيق شروط الاستخدام الخاصة بنا والاتفاقيات الأخرى ؛ أو
          حماية حقوق أو ممتلكات أو سلامة ماي ستور أو مستخدمينا أو غيرهم. ويشمل
          ذلك تبادل المعلومات مع الشركات والمؤسسات الأخرى من أجل الحماية من
          الاحتيال والحد من مخاطر الائتمان. ومع ذلك ، من الواضح أن هذا لا يشمل
          البيع أو التأجير أو المشاركة أو الكشف عن معلومات شخصية محددة من
          العملاء لأغراض تجارية يتم فيها انتهاك للالتزامات المنصوص عليها في
          إشعار الخصوصية هذا. بموافقتك: عدا عما تم ذكره بالأعلى، سيتم إشعارك في
          حال كانت معلوماتك ستصل لطرف ثالث، وسيكون لدك الخيار في حال عدم رغبتك
          بمشاركة المعلومة. إلى أي حد المعلومات الخاصة بي آمنة؟ نعمل على حماية
          أمن معلوماتك أثناء الإرسال باستخدام برنامج Secure Sockets Layer (SSL)
          ، الذي يقوم بتشفير المعلومات التي تقوم بإدخالها. نكشف فقط عن الأرقام
          الأربعة الأخيرة من أرقام بطاقتك الائتمانية عند تأكيد الطلب. وبالطبع ،
          نقوم بإرسال رقم بطاقة الائتمان بالكامل إلى شركة بطاقة الائتمان
          المناسبة أثناء معالجة الطلب. من المهم حماية نفسك ضد الوصول غير المصرح
          به إلى كلمة المرور الخاصة بك وإلى جهاز الكمبيوتر الخاص بك. تأكد من
          تسجيل الخروج عند الانتهاء من استخدام جهاز كمبيوتر مشترك. ماذا عن
          إعلانات طرف ثالث و الروابط لمواقع أخرى؟ يتضمن موقعنا إعلانات من طرف
          ثالث وروابط لمواقع أخرى. ماهي المعلومات التي أستطيع الوصول إليها؟ يتيح
          لك ماي ستور الوصول إلى مجموعة واسعة من المعلومات عن حسابك وتعاملاتك مع
          ماي ستور لغرض العرض فقط، وقد يتيح لك خيار التعديل لبعض المعلومات. ما
          هي الخيارات المتاحة لي؟ كما تم ذكره بالسابق، تملك دائماً حرية اختيار
          عدم مشاركة المعلومات، حتى ولو قد تحتاج لذلك عند قيامك بالشراء أو
          الاستفادة من مزايا ماي ستور كصفحتك الشخصية، قائمة الأمنيات، ومراجعات
          العملاء. تستطيع إضافة أو تحديث معلومات معينة في الصفحات المحددة في
          ماهي المعلومات التي أستطيع الوصول إليها؟. عندما تقوم بتحديث معلوماتك
          نقوم عادة بالاحتفاظ بالنسخة السابقة في سجلاتنا. إن لم تكن ترغب بالحصول
          على رسائل بريدية أو بريد إلكتروني منا الرجاء ضبط تفضيلات التواصل مع
          العملاء. ( إذا لم تكن ترغب بالحصول على شروط الاستخدام أو أي إشعارات
          قانونية أخرى منا، مثل إشعار الخصوصية، هذه الإشعارات يخضع لها استخدامك
          لماي ستور وتتحمل المسؤولية وحدك لمراجعتها في حال حدوث أي تغيير). إذا
          لم تكن تود أن نستخدم معلوماتك الشخصية للسماح لطرف ثالث بتخصيص
          الإعلانات التي نعرضها عليك، الرجاء ضبط تفضيلات الإعلانات الخاصة بك.
          خدمة " المساعدة" في معظم المتصفحات ستخبرك كيف تقوم بحماية متصفحك من
          قبول ملفات تعريف الارتباط جديد، وكيف تقوم بجعل المتصفح يقوم بتنبيهك
          عندما تتلقى ملفات تعريف ارتباط جديدة، أو كيف تقوم بتعطيل جميع ملفات
          تعريف الارتباط مرة واحدة. بالإضافة إلى ذلك، تستطيع القيام بتعطيل أو
          حذف البيانات المتشابهة التي تستخدم بواسطة إضافات المتصفح، كملفات تعريف
          الارتباط المؤقتة، من خلال تعديل إعدادات الإضافات أو زيارة موقع المصنّع
          الخاص بالإضافة. لأن ملفات تعريف الارتباط تمكنك من الاستفادة من مزايا
          موقع ماي ستور المهمة، ننصحك بتركها تعمل. مثال، إذا رفضت أو حظرت ملفات
          تعريف الارتباط الخاص بنا، لن تستطيع إضافة منتجات إلى سلة المشتريات
          الخاصة بك، أو الاستمرار للدفع، أو استخدام أي منتجات أو خدمات ماي ستور
          التي تتطلب تسجيل الدخول. هل مسموح للأطفال باستخدام ماي ستور؟ ماي ستور
          لا يبيع المنتجات للأطفال، نقوم ببيع منتجات يستطيع استخدامها الأطفال
          لكن يقوم بشرائها البالغين. إذا ما كان عمرك أقل من 18 سنة تستطيع
          استخدام ماي ستور فقط تحت إشراف الوالدين أو الأوصياء. نحن لا نقوم عمداً
          بجمع المعلومات من الأطفال الأقل من 18 سنة بدون موافقة والدي الطفل أو
          الأوصياء. شروط الاستخدام، التنبيهات، والتغييرات إذا قمت بزيارة ماي
          ستور فإن زيارتك وأي نزاع حول الخصوصية يخضعان لهذا الإشعار وشروط
          الاستخدام الخاصة بنا ، بما في ذلك القيود المفروضة على الأضرار ، وتسوية
          المنازعات ، وتطبيق قانون المملكة العربية السعودية. إذا كان لديك أي
          تحفظات بخصوص الخصوصية في ماي ستور بإمكانك التواصل معنا بوصف شامل لما
          يقلقك وسنحاول التوصل إلى حل. تتغير أعمالنا باستمرار ، وسيتغير أيضًا
          إشعار الخصوصية وشروط الاستخدام. قد نرسل رسائل تذكير دورية بالبريد
          الإلكتروني لإشعاراتنا وشروطنا ، ولكن يجب عليك مراجعة موقعنا الإلكتروني
          بشكل متكرر للاطلاع على التغييرات الأخيرة. ما لم يُنص على خلاف ذلك ،
          ينطبق إخطار الخصوصية الحالي لدينا على جميع المعلومات التي لدينا عنك
          وعن حسابك. ولكننا نلتزم بوعدنا ، ولن نغير سياساتنا وممارساتنا بشكل
          جوهري لجعلها أقل حماية لمعلومات العملاء التي تم جمعها في الماضي دون
          موافقة العملاء المتأثرين. أمثلة على المعلومات التي يتم جمعها المعلومات
          التي تقوم بإعطائها لنا: أنت توفر معظم هذه المعلومات عند البحث أو
          الشراء أو النشر أو المشاركة في مسابقة أو استبيان أو التواصل مع خدمة
          العملاء. على سبيل المثال ، تقوم بتوفير المعلومات عند البحث عن منتج ما
          ؛ تقديم طلب عبر ماي ستور ؛ تقديم معلومات في حسابك (وقد يكون لديك أكثر
          من حساب إذا كنت قد استخدمت أكثر من عنوان بريد إلكتروني عند التسوق
          معنا) أو ملفك الشخصي ؛ التواصل معنا عبر الهاتف أو البريد الإلكتروني أو
          غير ذلك ؛ إكمال استبيان أو استمارة اشتراك في مسابقة ؛ تجميع قوائم
          الأمنيات أو غيرها من سجلات الهدايا ؛ المشاركة في مجموعات المناقشة أو
          ميزات المجموعات الأخرى ؛ تقديم وتقييم مراجعات. وتفعيل تنبيهات توفر
          المنتج، مثل تنبيه "متوفر للطلب". نتيجة لتلك الإجراءات ، قد تزودنا
          بمعلومات مثل اسمك وعنوانك وأرقام هواتفك ؛ معلومات بطاقة الائتمان،
          والأشخاص الذين تم شحن المشتريات لهم ، بما في ذلك العناوين ورقم الهاتف؛
          الأشخاص (مع عناوين وأرقام هواتف) المدرجين في عملية الشراء بنقرة واحدة؛
          عناوين البريد الإلكتروني لأصدقائك وغيرهم؛ محتوى تقييماتك ومراجعاتك
          ورسائلك بالبريد الإلكتروني لنا؛ الوصف الشخصي والصورة في ملفك الشخصي
          والمعلومات المالية. المعلومات التلقائية: تشمل أمثلة المعلومات التي
          نقوم بجمعها وتحليلها عنوان بروتوكول الإنترنت (IP) المستخدم لتوصيل
          الكمبيوترأو الجوال بالإنترنت؛ معلومات تسجيل الدخول؛ عنوان البريد
          الإلكتروني؛ كلمه السر؛ معلومات الكمبيوتر أو الجوال والاتصال مثل نوع
          المتصفح والإصدار وإعدادات المنطقة الزمنية وأنواع المكونات الإضافية
          للمتصفح والإصدارات ونظام التشغيل والنظام الأساسي ؛ سجل الشراء ،الذي
          نجمعه أحيانًا ونستعين بمعلومات مماثلة من عملاء آخرين لإنشاء ميزات مثل
          " الأكثر مبيعاً" ؛ محدد موقع المعلومات الموحد (URL) الكامل للانتقال
          إلى ، وعبر ، ومن موقعنا على الإنترنت أو أحد تطبيقاتنا ، بما في ذلك
          التاريخ والوقت ؛ رقم ملفات تعريف الارتباط ، والمنتجات التي شاهدتها أو
          بحثت عنها ؛ ورقم الهاتف الذي استخدمته للاتصال بمركز خدمة العملاء. قد
          تستخدم أيضًا بيانات المتصفح مثل ملفات تعريف الارتباط، ملفات تعريف
          الارتباط المؤقتة (تُعرف أيضًا باسم مواضيع الفلاش المشتركة المشتركة)،
          أو بيانات خاصة بأجزاء محددة من موقعنا على الويب أو أحد تطبيقاتنا لمنع
          التزوير وأغراض أخرى. من خلال بعض الزيارات ، قد نستخدم أدوات برمجية مثل
          جافا سكريبت للتحكم في معلومات الاتصال ، بما في ذلك مشاركة الصفحة ،
          وأخطاء التحميل ، ومدة الزيارة لصفحات معينة ، ومعلومات تفاعل الصفحة
          (مثل الانسحاب ، والنقرات ، مرور الفأرة ) ، والاستخدام للتصفح بعيدًا عن
          الصفحة. قد نجمع أيضًا معلومات مفيدة لمساعدتنا في تحديد جهازك عن طريق
          الحماية من التزوير والتشخيص. أجهزة الجوال: توفر معظم الأجهزة المحمولة
          للمستخدمين إمكانية تتبع الموقع. في الغالب، هناك عناصر تحكم في قائمة
          إعدادات الجهاز. إذا كانت لديك أسئلة حول كيفية جونسون خدمات تتبع
          المواقع الخاصة بك، فننصحك بالاتصال بمشغل خدمة الجوال أو الشركة المصنعة
          للجهاز. المعلومات من مصادر أخرى: تشمل أمثلة على المعلومات التي نتلقاها
          من مصادر أخرى؛ معلومات تركيا والعنوان المحدثة من شركات الشحن لدينا أو
          القضاء الثالث الآخر، والتي نستخدمها لتصحيح سجلاتنا وتسويم عملية الشراء
          القادمة أو الاتصال بسهولة أكبر ؛ معلومات الحساب، ومعلومات الشراء أو
          الاسترداد أو الاسترجاع، ومعلومات عرض الصفحة من بعض الشركات التي ندير
          أعمالها التجارية مع شركة Coco أو التي تقدم خدمات تقنية إعلانية شاملة
          أو خدمات أخرى؛ مصطلحات البحث ومعلومات نتائج البحث من بعض عمليات البحث
          التي تتم عبر خدمات البحث الإلكتروني؛ نتائج البحث والروابط، بما في ذلك
          هدفها (مثل الروابط الإعلانية)؛ ومعلومات عن تاريخ مكاتب الائتمان، والتي
          تساعدها في منع الشفاء واكتشافه لبعض الخدمات الائتمانية أو الأساسية
          لبعض العملاء. المعلومات التي الوصول إليها: أمثلة على المعلومات التي
          يمكنك الوصول إليها بسهولة في ماي ستور تتضمن معلومات حديثة تتعلق
          بالطلبات الأخيرة؛ معلومات تعريف الشخصية (بما في ذلك الاسم والبريد
          الإلكتروني وكلمة التواصل وتفضيلات الإعلانات المتخصصة وودفتر براون
          واشتياء الشراء بنقرة واحدة)؛ إعدادات الدفع (بما في ذلك معلومات بطاقة
          الائتمان والشهادات البديلة ورصد بطاقات الائتمان) ؛ إعدادات التنبيه عبر
          البريد الإلكتروني (بما في ذلك التنبيهات التي توفرها منتجات وتسليمها
          ورسائل الويب) ؛ نتيجة لذلك (بما في ذلك نتائج صلاحياتك) ؛ تغطية
          التأمينات التجارية (بما في ذلك التأمينات التجارية) ؛ ملفك الشخصي (بما
          في ذلك مراجعات المنتج، والتوصيات، والتذكير، والملف الشخصي، وقائمة
          التصفحات).
        </p>
        </div>
      </div>
      <Footer/>
    </div>
  );
};

export default Privacypolicy;
