import React from "react";
import Header from "../components/Header";
import Footer from "../components/Footer";
import GreetingBanner from "../components/GreetingBanner";

const ReturnsAndExchanges = () => {
	const containerStyle = {
		fontSize: "15px",
		fontWeight: '600',
		// textAlign: 'end',
		margin: "20px 0",
		fontFamily: 'Cairo, sans-serif',
		color: '#8b8181',
		direction: "rtl",
	};

	const listItemStyle = {
		margin: "10px 0",
		display: "flex",
		flexDirection: "right",
		alignItems: "flex-start",
	};

	const customIcon = (
		<svg
			width="22"
			height="16"
			xmlns="http://www.w3.org/2000/svg"
			fill="#008000"
			viewBox="0 0 16 16"
		>
			<path
				fillRule="evenodd"
				d="M6.293 11.293l-3-3a1 1 0 011.414-1.414L6 9.586l6.293-6.293a1 1 0 111.414 1.414l-7 7a1 1 0 01-1.414 0z"
			/>
		</svg>
	);

	return (
		<div>
			<GreetingBanner/>
			<Header />
			<div style={{ padding: "20px" }}>
				<ul style={containerStyle}>
					<li style={listItemStyle}>
						{customIcon}
						متى يمكنني الحصول على قسيمة بديلة اذا تم التأكد من عدم صلاحية
						القسيمة؟ تستغرق عملية التأكد من عدم الصلاحية القسيمة ثلاثة إلى خمسة
						أيام عمل تقريبا, وذلك من تاريخ رفع البلاغ
					</li>

					<li style={listItemStyle}>
						{customIcon}
						إن واجهت ظرفاً طارئاً لم يسمح لي بإعادة المنتج في الوقت المحدد لذلك،
						ولكنني ما زلت أريد إرجاعه، هل س يعالج فريق خدمة العملات الطلبات
						ويتعامل معها على أساس فردي. قد يقبل ماي ستور ارجاع منتجاتك بعد المدة
						المحددة لذلك بشكل استثنائي في الحالات التالية: أن يكون المنتج في
						تغليفه وحالته الأصلية. أن لا يكون قد تعدى بعد انتهاء مدة الارجاع
						أكثر من أسبوع واحد. إذا تم قبول طلب الإرجاع الخاص بك، فستسترد 80٪
						فقط من السعر الأصلي للمنتج. لن يتم قبول المنتجات التالفة أو ذات
						الأجزاء المفقودة أو التي ليست في حالتها الأصلية التي استلمت بها أو
						المنتجات الواضح عليها علامات الاستخدام. استثنائياً، قد يتم قبول
						استبدال المنتجات التي تم فتحها، ولكنها تخضع لتلك الخصومات: 30% على
						الهواتف. 15% على المنتجات المادية
					</li>

					<li style={listItemStyle}>
						{customIcon}
						كم المدة التي يستغرقها ماي ستور لمعالجة طلب الاستبدال؟ عند استلام
						وتأكيد أنك قمت بإرجاع المنتج بنفس حالته التي استلمته بها وبنفس
						العلبة والتغليف الأصلي ودليل المستخدم والملحقات، سنقوم بمعالجة عملية
						الاستبدال خلال يومين إلى ثلاثة أيام عمل.
					</li>

					<li style={listItemStyle}>
						{customIcon}
						هل يمكنني تبادل أي منتج؟ ليس في الوقت الحالي، ولكن يمكنك أن تطلب
						استرداد المبلغ المدفوع أو الاستبدال.
					</li>

					<li style={listItemStyle}>
						{customIcon}
						استلمت منتج تالف \ به عيب هل يمكنني استرداد ما دفعته أو الحصول على
						بديل؟ في حال كان المنتج الذي استلمته تالف أو به عيب، يمكنك ببساطة
						إرجاع المنتج إن كان بنفس الحالة التي استلمته بها وبعبوته الأصلية
						وأدلة المستخدم والملحقات. يرجى فقط التأكد من إعادته خلال 7 أيام -إن
						كان من منتجات أبل (آيفون وآيباد) فقط - وسنتولى عملية استبداله وشحنه
						وتوصليه إلى باب منزلك في حال كان منتجك تالفاً أو به عيب. إذا لم يكن
						الاستبدال المطلوب متاحًا، فسنقوم بإرجاع المبلغ المدفوع إلى محفظتك
						الإلكترونية. يجب أن تكون المنتجات التي ترغب في إرجاعها بسبب تلفها
						خالية من الخدوش أو علامات إساءة الاستخدام وقد يتطلب الأمر تقديم
						تقرير فني من مركز الصيانة قبل الاستبدال. سنقوم باستبدال المنتجات
						المرجعة بسبب عيب التصنيع (غير البرامج) بمنتج مماثل خلال يومين إلى
						ثلاثة (2-3) أيام عمل من تأكيد أن المنتج الخاص بك معيب أو تالف. إذا
						وجدنا أن المنتجات المرتجعة خالية من التلف أو العيوب، فسنعيد أرسال
						المنتجات لك وستتحمل رسوم الشحن والتوصيل. إذا طلبت استرداد الأموال
						بدلاً من ذلك، فسنعالج طلبك مع أي رسوم شحن وتوصيل خلال يومين إلى
						ثلاثة (2-3) أيام عمل من تأكيد أن العنصر المنتج المرتجع معيب أو تالف.
						نحن لا نقبل إرجاع المنتجات التي بها خدوش، أو المتضررة نتيجة لسوء
						الاستخدام و نتيجة لاتصال الجهد خاطئ. ونحدد ما إن كان المنتج يستوفي
						الشروط أم لا من منظورنا الخاص.
					</li>

					<li style={listItemStyle}>
						{customIcon}
						هل يمكنني إرجاع أو استبدال منتج اشتريته عن طريق ماي ستور؟ نعم،
						بالطبع يمكنك فعل ذلك.
					</li>

					<li style={listItemStyle}>
						{customIcon}
						كيف أرجع أو استبدل منتج اشتريته عبر ماي ستور؟ سجل الدخول إلى
						"حسابي". اذهب إلى "طلباتي". اختر العنصر الذي ترغب باستبداله من
						الطلب. اضغط على "التفاصيل" ثم اضغط على "أرجع المنتج". اختر المنتجات
						التي ترغب بإرجاعها من ضمن الطلب ثم اضغط على "استمر" - حاليا بالإمكان
						اختيار منتج واحد لكل طلب إعادة. على الشاشة التالية يرجى تحديد حالة
						صندوق المنتج وسبب الإرجاع والوقت المفضل ونوع الإعادة (تبديل أم
						إعادة).
					</li>

					<li style={listItemStyle}>
						{customIcon}
						أين عملية الاستبدال الخاصة بي؟ وهل يمكنني التحقق من حالتها؟ أن كنت
						في انتظار عملية استبدال وتريد التحقق من حالتها، يمكنك عرض هذه
						المعلومات من خلال "حسابي". للتحقق من حالة الاستبدال: ادخل إلى حسابك
						اذهب إلى "طلباتي" اختر "تفاصيل الطلب" بجانب الطلب. ملاحظة: يتم عرض
						حالة الاستبدال في الجزء السفلي من ملخص الطلب. بإمكانك دائما التواصل
						معنا في حال وجود أية استفسارات تخص الإرجاع
					</li>

					<li style={listItemStyle}>
						{customIcon}
						اشتريت بطاقة لعبة لكنني اكتشفت أنها ليست نفس المنطقة التي أرغب فيها
						، هل يمكنني استبدالها أو إعادته لا, يجب أن تتوافق دولة القسيمة
						والحساب المستخدِم لها مع بعضهما البعض حتى تتم الاستفادة من القسيمة
					</li>

					<li style={listItemStyle}>
						{customIcon}
						هل يمكنني استبدال القسيمة إذا كانت غير صالحه؟ يتم استبدال القسائم
						بمنتج مماثل في حالة عدم صلاحيتها, وذلك بعد التأكد من عدم استخدامها
					</li>
				</ul>
			</div>

			<Footer />
		</div>
	);
};

export default ReturnsAndExchanges;
