import React from "react";
import Header from "../components/Header";
import Footer from "../components/Footer";
import GreetingBanner from "../components/GreetingBanner";

const TermsandConditions = () => {
	const containerStyle = {
		minHeight: "100vh",
		display: "flex",
		flexDirection: "column",
	};

	const textStyle = {
		fontSize: "15px",
		fontWeight: '600',
		textAlign: 'end',
		margin: "20px 0",
		fontFamily: 'Cairo, sans-serif',
		color: '#8b8181',
	};

	const contentStyle = {
		flex: 1,
		padding: "20px",
		display: "flex",
		flexDirection: "column",
		marginBottom: "auto",
	};

	const scrollableContentStyle = {
		// overflowY: "auto",
		// maxHeight: "80vh",
	};

	return (
		<div style={containerStyle}>
			<GreetingBanner/>
			<Header />
			<div style={contentStyle}>
				<div style={scrollableContentStyle}>
					<p style={textStyle}>
						مرحبا بك في متجر ماي ستور (يشار إليه باسم "المتجر/ خدمة عبر
						الإنترنت)، خدمة متقدمة بواسطة شركة قنوات الاتصالات السعودية STC
						Channels في المملكة العربية السعودية. المتجر مشغّل بواسطة ماي ستور
						(يشار إليه بـ "نحن/لنا/ ضمير المتكلم"). كمستخدم (يشار إليه بـ " أنت
						/ العميل/ ضمير المخاطب") للموقع يجب عليك قراءة الشروط والأحكام أدناه
						("الشروط والأحكام"). من خلال شرائك عبر المتجر، أنت تتوافق مع خضوعك
						للشروط والأحكام. أقرأ جيدًا قبل استخدام الخدمة عبر الإنترنت. إذا لم
						توافق (أو لا تخضع للشروط والأحكام) على أي من الشروط والأحكام، فيجب
						عليك عدم استخدام الخدمة. شروط الاستخدام حقوق الاستخدام متاحة لأي شخص
						محدد قانونياً للموافقة على الاتفاقيات بموجب القانون المطبق. الأشخاص
						"الغير مؤهلين للعقود" حسب القانون المحلي غير المؤكد لهم استخدام
						المتجر. إذا كنت قاصرًا (على سبيل المثال: عمرك أقل من 18 عامًا)،
						يمكنك استخدام المخزون تحت الرقابة العرقية أو الوصي الذي يوافق على
						استخدام هذه؛ هؤلاء الذين يستخدمون المتجر خارج المملكة العربية
						السعودية يطلبون الخضوع للقوانين المحلية ويمكن تطبيقها. ماعدا في حالة
						وجود تنزيل إضافي مخصص لخدمات أو خدمات خاصة، هذه الشروط والأحكام تحل
						محل كل ما سبقها من تمثيلات أو تفاهمات أو اتفاقيات. باستخدامك للموقع
						أنت توافق على الخضوع للشروط والأحكام. المعلومات الشخصية تتوصل
						بمعلوماتك الشخصية من خلال التصميم لسياسة الأمان الخاصة بنا. الرجاء
						الاطلاع على إشعار الخصوصية لتفهم ممارساتنا. الاتصال الالكتروني عندما
						تستخدم خدمات ماي ستور، أو إرسال بريد إلكتروني، رسائل نصية، أو
						الاتصال آخر من خلال جهازك المكتبي أو هاتفك الجوال لنا، قد تكون
						تتواصل معنا إلكترونيًا. وبالتالي تتوافق على أن يتم التواصل معك من
						قبلنا إلكترونياً، مثل البريد الإلكتروني، الرسائل النصية، تنبيهات
						الجوال، أو تنبيهات ورسائل على التخزين من خلال خدمات ماي ستور الأخرى،
						مثل مركز الرسائل، وتمكنك من الحصول على نسخة من هذا التواصل للاحتفاظ
						بها. أنت توافق على أن كل توافقيات، الاشعارات، الانسجامات، وكل ما
						نقدمه لك من خلال التواصل الاجتماعي يلبي أي حاجة كما تفعل التواصل
						الخطي. حقوق النشر جميع المحتويات المضمنة أو المتواجدة من خلال ماي
						ستور، كالنصوص، القرافيكس، الشعارات، أزرار الإختراق، الصور، التعديلات
						الصوتية، التحميل الرقمي، والبيانات المساهمة هي ملكية لماي ستور أو
						لمقدم المحتوى الخاص بها ومحمية بموجب قوانين وقوانين المملكة العربية
						السعودية وقوانين حقوق النشر العالمية. يشمل المحتوى المتضمن أو يتوفر
						في ماي ستور هو ملكية خاصة لماي ستور ومحمي بقوانين و قوانين السعودية
						و قوانين حقوق النشر العالمية. موافق استخدام خدمة معينة من ماي ستور
						تحتاج إلى حساب شخصي لك في ماي ستور، ويتعين عليك تسجيل الدخول لحسابك
						بالإضافة إلى توفر طريقة دفع سارية. إن كان هناك أي مشكلة في الخصم من
						طريقة الدفع، يمكنك الخصم من أي طريقة دفع أخرى سارية وموجودة في
						حسابك. أنت مسؤول عن حماية معلومات حسابك وكلمة المرور الخاصة بك
						وتقييد تسجيل الدخول لحسابك، وتوافق على تحمل كافة التفاصيل التي
						تحملها حسابك أو كلمة المرور الخاصة بك. ماي ستور يقدم منتجات للأطفال،
						ولكنه يبيعها للبالغين، الذين يقومون بالشراء من خلال بطاقات
						الائتمانية أو أي من طرق الدفع الأخرى المخصصة. إن كان عمرك أقل من 18
						سنة يمكنك استخدام خدمات ماي ستور تحت الفجر أو الأوصياء فقط. ماي ستور
						لا يمكن تحديدها لرفض الخدمة، إلغاء الاشتراكات، إلغاء حقك في استخدام
						خدمات ماي ستور، حذف أو تعديل المحتوى، أو إلغاء حجز الطلبات حريتها في
						أي وقت دون تحمل أي التزامات أو تبعات التعليقات، التعليقات، التواصل
						الاجتماعي، وأيًا من ذلك يمكنك إضافة التعليقات، التعليقات، الصور،
						الفيديوهات، وأيًا منها الأخرى؛ إرسالية تواصل آخر؛ اقتراحات، أفكار،
						تعليقات، أسئلة، أو معلومات أخرى، كما لا يحتوي المحتوى على مخفي، غير
						قانوني، مقترح للخصوصية، تشهير، مخل بالآداب، يتعارض مع حقوق الملكية
						الفكرية (بالإضافة إلى حقوق النشر)، أو غير ضارة بذلك لطرف ثالث
						الاشتراك في الاعتراض، ولا يحتوي على أو مكون من فيروسات البريد
						الإلكتروني، الحملات الليبرالية، والتجارية والرسائل المتسلسلة
						والجماعية أو أي شكل من أشكال "البريد المزعج" أو الرسائل الإلكترونية
						المرغوبة ترغب بها. لا يسمح باستخدامك ببريد إلكتروني غير صحيح، انتحال
						الشخصيات أو الكيانات، أو التضليل فيما يتعلق بأصل البطاقة أو آخر
						محتوى. تابع ماي ستور بشكل كامل (لكن ليس الالتزام) تمت إزالته أو
						تعديل أي محتوى مشابه، لكن لا تقوم بمراجعة المحتوى المنشورة. إذا قمت
						بتقديم محتوى أو رفع المحتوى، ماعدا في تحديدنا لخلاف ذلك، أنت تمنح
						ماي ستور حقوق الحقوق حصريًا، خالٍ من الملكية الحصرية، غير قانوني
						وغير قابل للإلغاء، وغير مرخص بالكامل للاستخدام، إعادة الإنتاج،
						إنشاء، التبني، النشر، أداء، ترجمة، اشتقاق أعمال ، انشر هذا المحتوى
						في جميع أنحاء العالم بأي وسيلة. أنت تمنح ماي ستور والجهات المرخصة
						الحق في استخدام الاسم الذي قدمته وربطه بالمحتوى، إذا ما رغبت في ذلك.
						أنت تمثل و تتضمن أنك تملك أو تتحكم في حقوق المحتوى الذي تنشره؛ وأن
						المحتوى دقيق؛ وأن المحتوى الذي يصله لا ينتهك هذه السياسة ولا يسبب
						بضرر أي شخص أو كيان؛ وأنك ستعوض ماي ستور عن أي مطالبات تنتج عن محتوى
						مقدمته. ماي ستور لها الحق وليس الاستمرار وتعديل أو إزالة أي نشاط أو
						محتوى. لا تتحمل ماي ستور أي مسؤولية عن أي محتوى يتم نشره بواسطتك أو
						عن طريق أي طرف ثالث. خطر الضياع جميع المشتريات غير الضرورية من ماي
						ستور معدة لعقود الشراء. مما يعني أن خطر الضياع والمسؤولية بالنسبة
						لهذه المنتجات تقع عليك بعد توصيلنا شحنة الناقل. الاسترجاع، الأسئلة
						المستردة، والمسؤولية ماي ستور لا تتحمل مسؤولية البضائع المرجعية لكي
						تصل إلى مراكزنا المعتمدة. لمزيد من المعلومات عن استرجاع الأموال
						المستردة، يرجى زيارة سياسة الإرجاع والاستبدال المعلومات واكتمال
						وتوقيتها ماي ستور تحاول أن تلتزم بدقة قدر الإمكان. مع ذلك، ماي ستور
						لا يضمن أن المعلومات المتواجدة على الدقة، كاملة، معتمدة، حديثة، أو
						من سبب. تسجيل المواد على التخزين فقط للمعلومات العامة مما يعني أنها
						يجب أن لا يعتمد عليها بشكل مستقل في اتخاذ القرار بدون معرفة معلومات
						إضافية وأكثر شمولاً أو حديثة. أي موثوقة على المواد التي تحتوي على
						البيانات التجارية تتحملها بمفردك. قد يحوي هذا التحكم في التحكم
						بمعلومات معينة. المعلومات بالضرورة ليست حديثة ومتواجدة فقط كمرجع.
						نحن نحتفظ بحق التحكم في محتويات المتجر في أي وقت، ولكن لا نلتزم بدمج
						المعلومات على المتجر. أنت توافق على تحملك مسؤولية مراقبة التغييرات
						في المتجر. إذا كان المنتج يوفره ماي ستور لا يتوافق مع الوصف، حلك
						الوحيد هو في إعادته بدون استخدامه. تعديل الخدمة والأسعار
						"السعرالحالي" يعني السعر المقترح للمنتج كما تم الحصول عليه من
						المصنع، المورد، أو البائع. نقوم بشكل دوري بفحص قوائم الأسعار ومقارنة
						الأسعار الموجودة في ماي ستور والتجارات الجزئية. قد تحمل بعض المنتجات
						"السعر سابقًا"، والذي يحدده تاريخ سعر المنتج الحديث في ماي ستور. لا
						يمكنك شراء سعر المنتج بسهولة. بالرغم من أنها أفضل منا، فإن عددا
						قليلا من المواد قد يختلف سعرها. إذا كان سعر المنتج المباع على ماي
						ستور أعلى من المكان الذي تحدده، فسوف نقوم بدورنا إما بالتواصل معك
						لإعطائنا تعليمات قبل الشحن أو إلغاء الطلب وإعلامك بذلك، قد تتبع بعض
						الشركات سياسات أخرى في حالات خطأ التسعير للشراء. عروض الهدايا
						للتغيير بدون تنبيه. نحتفظ بالحق في تعزيز أو إلغاء الخدمة (أو أي جزء
						من المحتوى) دون الحاجة إلى المطالبة في أي وقت. لا نتحمل مسؤولية
						تجاهك أو تجاه أي طرف ثالث، تغيير السعر، الإيقاف، أو عدم الخدمة. لا
						نقدم خصمًا مقدمًا من بطاقتك الائتمانية لإدخال المنتج في مرحلة الشحن،
						وفي حالة المنتجات الرقمية، إذا قمنا بتوفير المنتج لك. المنتجات أو
						الخدمات لقد بذلت قصارى جهدها لعرض الصور الجميلة والمطبوعة على نطاق
						واسع. لا تستفيد من شاشة الجهاز الخاص بك ويستعرض بالدقة العالية. نحن
						لا نلتزم بالخضوع ولكن لا نلتزم بعدم التوقف عن بيع المنتجات أو
						الخدمات لأي شخص، منطقة جغرافية أو قضائية. وقد نطبق هذا الحق في بعض
						الحالات. نحتفظ بالكميات لأي منتجات أو خدمات نقدمها. جميع المواصفات
						للمنتجات أو المنتجات المتاحة للتغيير في أي وقت بدو التنبيه. نحن
						نحتفظ بعدم توفير أي منتج في أي وقت. يعتبر أي عرض لأي منتج أو خدمة
						يتم تقديمه على هذا المتجر بسهولة إذا كان محظورًا. نحن لا نضمن أن
						جودة أي منتج، خدمة، معلومة، أو منتج مشتراه أو لحظتها تصل إلى
						توقعاتك، أو أن أي خطأ في خدمة يقوم بتصحيحه. تطبيق صلاحيات عند
						استخدامك لماي ستور تحسن لنا بعض الأذونات الخاصة بك، معظم أجهزة
						الجوال تمكنك من الحصول على المعلومات عن هؤلاء الأذونات. القدرة على
						معرفة الصلاحيات في التطبيقات من ماي ستور عن طريق اتباع هذه
						التعليمات: لمعظم أجهزة أندرويد: أدخل على التطبيق الرئيسي. اختر إدارة
						التطبيقات. اختر التطبيق. اسحب الشاشة لتتمكن من الوصول إلى "أذونات"
						للمدة التي يهمها والتي تمتلك التطبيق لاستخدامها. لمعظم أجهزة ios:
						أدخل على شاشة الإعدادات. اختر التطبيق ليت ماهي التي تملك التطبيق
						لاستخدامها. لمعظم أجهزة الويندوز: في الشاشة، ابدأ على "المتجر" لفتح
						متجر ويندوز. ابحث في المتصفح عن التطبيق، ومن ثم المسه أو انقر عليه.
						اسحب الشاشة لتتمكن من الوصول إلى "التفاصيل" في صفحة وصف التطبيق
						لفترة ما يهمه التي تمتلك التطبيق لاستخدامها. الفاتورة ومعلومات
						الحساب نملك الحق لرفض أي طلب يطلبه منا. نملك الحق بمفردنا أو إلغاء
						الطلب للشخص الواحد، لكل واحد، أو لكل واحد. هذا التحديد قد يشمل
						الطلبات التي تتم بواسطة حساب عميل واحد، بطاقة تأمينية واحدة،
						أو/الطلبات التي تستخدم نفس حساب الشحن أو/ و الفاتورة. في حالة تغيرات
						أو إلغاء الطلب، سنحاول إعلامك من خلال التواصل معك عن طريق البريد
						الإلكتروني، عنوان الشحن/ الفاتورة أو رقم الهاتف الذي قدمته عند إجراء
						الطلب. نملك الحق أو حظر الطلبات التي بحكمنا الشخصي ونرى أنه قام
						بأمرها يتعلق أو تاجر أو موزع. أنت توافق على تقديم معلومات حديثة
						وكاملة ومشتريات دقيقة ومعلومات حسابك لجميع المشترين التي تقوم بها في
						متجرنا. أنت توافق على تحديث حسابك وأي معلومات أخرى تتضمن بريدك
						الإلكتروني، رقم بطاقتك الائتمانية وتواريخ سيتم إنجازها لتتمكن من
						التواصل معك عند الحاجة. سبب، عدم الدقة والحذف من حين لآخر قد تكون
						بعض المعلومات في موقعنا أو في الخدمة تحمل أخطاء مطبعية، غير دقيقة أو
						محذوفة لها العلاقة بوصف المنتج، المقترحات، العروض، الحملات، تكاليف
						شحن المنتج، مدة التوصيل والتوفر. نحتفظ بخيار تعديل أي خطأ، مختلف
						تمامًا، الحذف، ولتغيير أو تحديث المعلومات أو حذف الطلبات في حال كانت
						أي معلومة عن الخدمة أو أي موقع مرتبط غير دقيقة في أي وقت دون إشعار
						مسبق (بما في ذلك بعد تسليمك للجميع) قد لا يتم تحديد، عدم تحديد أو
						توضيح المعلومات المتعلقة بالخدمات أو الموقع ذي الصلة، بما في ذلك
						تحديد البيانات والمعلومات والمواصفات والعدالة التي يطلبها القانون.
						لا يجود تحديث محدد أو تاريخ تطبيق على الخدمة أو أي موقع مرتبط يؤخذ
						كمؤشر على أن جميع المعلومات للخدمة أو تحديد المواقع المترابطة تم
						تعديلها أو تحديثها. المنتجع المحظورة بالإضافة إلى المحظورات التي تم
						تحديدها بشكل مستمر في شروط وأحكام الخدمة، يحظر عليك استخدام إدخالات
						هذا التخزين في حالات: 1) أي أهداف غير قانونية، 2) لتحفيز الآخرين على
						المشاركة في أي حركة غير فاعلة، 3) لوضع أي قوانين أساسية، فيدرالية،
						بلدية، حكومة، أوات، أو قوانين محلية، أو أقليمية؛ 4) لفعل حقوق
						الملكية الفكرية الخاصة بنا أو بالأخرين؛ 5) مضايقة، إهانة، إهانة،
						إيذاء، تشهير، استهانة، ترهيب، أو تدريب على أساس عنصري، جنسي، ديني
						عرقي، عمري، أقليات، أو إعاقة؛ 6) نشر معلومات مضللة أو خاطئة؛ 7)
						تحميل أو إشراك فايروسات أو نوع من أنواع الشفرات التي يمكن تشغيلها
						بأي طريقة بالتأثير على وظيفة عمل خدمة أو أي مواقع مرتبطة، أو مواقع
						أخرى، أو الإنترنت؛ 8) جمع وتتبع المعلومات الشخصية للأشخاص؛ 9) إرسال
						الرسائل المزعجة، تصيد، زرع؛ 10) أي نشطة بذيئ أو غير مهني؛ أو 11)
						الاشتراك أو التحايل على ميزات الأمان الخاصة بالخدمة أو أي موقع ذو
						صلة أو مواقع ويب أخرى أو الإنترنت. نحن لا نملك حق حقوقك في استخدامك
						للخدمة أو أي موقع إلكتروني ذي صلة بانتهاك أي من المنتجع المحظورة،
						والمسؤولون رسميًا عن أي ضرر يتحدثون معنا أو يفسرون للطرف الثالث.
						المشاريع الأخرى نقدم روابط لشركائنا أو مشاريع أخرى محددة. إذا ما قمت
						باختيار أي خدمة أو منتج من تلك المشاريع أو الأشخاص، فلابد من الذهاب
						مباشرة من الطرف الثالث وليس من ماي ستور. نحن لا نتحمل مسؤولية الفحص
						والفحص ولا نضمن ما تقدمه هذه المشاريع أو الأشخاص (متضمناً المحتوى
						الموجود في مواقعهم). ماي ستور لا تتحمل أي مسؤولية عن تصرفات، منتج،
						ومحتوى جميع هذه المشاريع أو أي طرف ثالث، يجب عليك قراءة التقارير
						الخصوصية الخاصة بها وشروط الحكم الآخر. بدلا من ذلك أنت توافق على
						تعويض ماي ستور، والدفاع عنها بمفردها متروبوليتان، والشركاء،
						والمسؤولين، والمديرين، والوكلاء، والمقاولون، والمرخص لهم، ومقدمي
						الخدمات، والمقاولون من الباطن، بنجاح، والمتدربين، بنجاح، إلى أي
						مطالبات أو أذية، بما في ذلك في ذلك أتعاب المحاماة التي تقوم بأي طرف
						ثالث بسببك أو تقدم عنكم بهذه الشروط والأحكام الخاصة بالخدمة أو
						المستندات التي تدمجها بالإحالة، أو تساهم في قانون أو حقوق طرف ثالث.
						سهلة الاستخدام في ما إذا كان أي حكم من الألعاب وشروط الخدمة هذه قد
						تم اعتبارها غير قانونية أو غير قانونية أو غير قابلة للتنفيذ، يجب أن
						يكون هذا الحكم قابلاً للتنفيذ إلى الحد الأقصى المسموح به للقانون،
						جزء غير قابل للتنفيذ بشكل مستقل من هذه الشروط والأحكام خدمة ، لا
						تؤثر على هذا التغير في صلاحية ونفاذ أي تطبيق آخر متحرك. النهاية لا
						يزال مع خيار المتكبدة قبل تاريخ انتهاء سارية بعد التنازل عن هذه
						الموافقة لجميع التبرعات. هذه الشروط وشروط خدمة سارية الإبداع ما لم
						يتم الأمر من قبلنا. يمكنك إعلامنا في أي وقت لأنك ترغب في استخدام
						خدماتنا، أو الاستعداد لاستخدامنا بالإضافة إلى استطلاع هذه الشروط
						والأحكام. إذا تأكدنا في حكمنا الوحيد، أو نشك في أنك مخفي، للالتزام
						بشروط أو تشغيل من شروط وأحكام الخدمة هذه، فيجوز لنا التنازل عن هذه
						الموافقة في أي وقت دون إشعار، وستظل مسؤولاً عن جميع المنظمات
						المستحقة حتى تاريخ إنهاء العمل ؛ و / أو وفقًا لذلك يمنعك من الوصول
						إلى خدماتنا (أو أي جزء منها). تنازل لا فشل ماي ستور في ممارسة أو
						تطبيق أي حق أو حكم من شروط وأحكام ويتنازل عن هذه الخدمة عن هذا الحق
						أو الحكم. الشكل الكامل تمثل أحكام تشغيل خدمة وأية سياسات أو قواعد تم
						نشرها على هذا المتجر أو فيما يتعلق بالخدمة التوافق الكامل والتفاهم
						بينك وبيننا ويحكم استخدامك للخدمة، وتحل هذه الجزئية محل أي ميزة
						سابقة أو قائمة ، تواصل أو عروض ، سواء كانت شفوية أو مكتوبة ، بينك
						وبيننا ( بما في ذلك، على سبيل المثال لا الحصر، أي إصدارات سابقة من
						شروط وأحكام الخدمة). القانون الصارخ مناطق وأحكام خدمة وأية مساهمة في
						التأمين يتم تحتها توفير الخدمات لك لقوانين المملكة العربية السعودية
						وتفسر لها. تغييرات على شروط الخدمة يمكنك مراجعة أحدث إصدار من تفاصيل
						وأحكام الخدمة في أي وقت في هذه الصفحة. نحن نملك الاختيار، حسب
						تصنيفنا وحدنا، في تحديث أو تغيير أو استبدال أي جزء من شروط وأحكام
						الخدمة هذه عن طريق نشر التحديثات والتغييرات على موقعنا. ستتحمل
						مسؤولية مسؤوليتك عن مراجعة تفاصيل الرحلة الجوية للقيام بالأحداث. إن
						ونتيجة لذلك، في استخدام أو الوصول إلى موقعنا على الويب أو الخدمة بعد
						نشر أي تغييرات على هذه الشروط والأحكام الخاصة بالخدمة توافق على هذه
						التغييرات. معلومات التواصل لطلب الشروط والأحكام للخدمة، جميع
						المراسلات يجب أن تم عبر: الشبكة الرئيسية لقنوات الإتصالات السعودية:
						شارع العليا، حي المروج صندق البريد 86241، الرياض 11622 المملكة
						العربية السعودية
					</p>
				</div>
			</div>
			<Footer />
		</div>
	);
};

export default TermsandConditions;
